/* 
  SBXErrors.strings
  Secrets

  Created by Paulo Andrade on 9/25/12.

*/

"UnexpectedError.errorDescription" = "Erro inesperado";
"UnexpectedError.failureReason" = "Desculpe, a operação falhou devido a um erro inesperado. Contate o suporte se o problema persistir.";

"ModelInvalidProperty.errorDescription" = "Valor inválido";
"ModelInvalidProperty.failureReason" = "A %@ %@ must be a %@";

"DataStoreIncompatibleMasterKeyError.errorDescription" = "Chave-mestre incompatível";
"DataStoreIncompatibleMasterKeyError.failureReason" = "A chave-mestre deste documento falhou na validação.";

"DataStoreMustBeUnlockedError.errorDescription" = "Armazenamento de dados bloqueado";
"DataStoreMustBeUnlockedError.failureReason" = "O armazenamento de dados deve ser desbloqueado para realizar esta operação.";

"DataStoreNotPassphraseProtectedError.errorDescription" = "Armazenamento de dados desprotegido";
"DataStoreNotPassphraseProtectedError.failureReason" = "O armazenamento de dados ainda não está protegido por senha.";

"DataStoreCorruptedError.errorDescription" = "O documento é inválido";
"DataStoreCorruptedError.failureReason" = "Não foi possível abrir o documento, ele pode estar corrompido.";

"DataStoreURLNotSetError.errorDescription" = "URL do armazenamento não definido";
"DataStoreURLNotSetError.failureReason" = "O URL do armazenamento deve ser definido antes de realizar esta operação";

"DataStoreSynchronizationFailedError.errorDescription" = "Falha na sincronização";
"DataStoreSynchronizationFailedError.failureReason" = "A sincronização falhou devido a um erro inesperado.";

"DataStoreIncorrectPassphraseError.errorDescription" = "Senha incorreta";
"DataStoreIncorrectPassphraseError.failureReason" = "Falha ao desbloquear o armazenamento de dados com a senha fornecida";

"DataStoreMigrationUnknownModelError.errorDescription" = "Atualização necessária";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets.
*/
"DataStoreMigrationUnknownModelError.failureReason" = "Parece que seus dados foram salvos usando uma versão mais recente do %@.";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets. Please update to the latest version and try again.
*/
"DataStoreMigrationUnknownModelError.recoverySuggestion" = "Parece que seus dados foram salvos usando uma versão mais recente do %@. Atualize para a nova versão e tente de novo.";

"DataStoreMigrationSourceMetadataError.errorDescription" = "Formato de arquivo desconhecido";
"DataStoreMigrationSourceMetadataError.failureReason" = "Falha ao identificar o formato do arquivo";

"NetworkConnectionVersionMismatchError.errorDescription" = "Incompatibilidade de versão";
"NetworkConnectionVersionMismatchError.failureReason" = "O dispositivo com o qual você está tentando se conectar está usando uma versão incompatível. Assegure que seu software esteja atualizado.";

"NetworkConnectionInterruptedError.errorDescription" = "Falha na conexão";
"NetworkConnectionInterruptedError.failureReason" = "A conexão foi interrompida por motivo desconhecido.";

"NetworkConnectionBadRequestError.errorDescription" = "Falha na conexão";
"NetworkConnectionBadRequestError.failureReason" = "A conexão foi interrompida devido a um pedido inválido.";

"NetworkConnectionInternalError.errorDescription" = "Falha na conexão";
"NetworkConnectionInternalError.failureReason" = "A conexão falhou devido a um erro interno";

"NetworkConnectionUnauthorizedRequestError.errorDescription" = "Falha na conexão";
"NetworkConnectionUnauthorizedRequestError.failureReason" = "A conexão foi interrompida devido a um pedido não autorizado.";

"NetworkConnectionFailedError.errorDescription" = "Falha na conexão";
"NetworkConnectionFailedError.failureReason" = "Falha ao estabelecer uma conexão com o par. Verifique as configurações de Wi-Fi e Bluetooth.";

"NetworkConnectionTimedOutError.errorDescription" = "Tempo esgotado da conexão";
"NetworkConnectionTimedOutError.failureReason" = "Falha ao estabelecer uma conexão em um intervalo de tempo razoável.";

"OperationCancelledError.errorDescription" = "Operação cancelada";
"OperationCancelledError.failureReason" = "Operação cancelada conforme a sua solicitação.";

"OperationTimedOutError.errorDescription" = "Tempo esgotado da operação";
"OperationTimedOutError.failureReason" = "Falha ao concluir a operação em um intervalo de tempo razoável.";

"UbiquitousSyncNotEnabledError.errorDescription" = "iCloud Sync desabilitado";
"UbiquitousSyncNotEnabledError.failureReason" = "O iCloud Sync deve ser habilitado para realizar esta operação.";

"UbiquitousSyncIdentifierDiffersError.errorDescription" = "Incompatibilidade do iCloud Sync";
"UbiquitousSyncIdentifierDiffersError.failureReason" = "Os dados armazenados no iCloud parecem ser de um usuário diferente. Você pode ter trocado para um usuário diferente do iCloud desde que habilitou o iCloud Sync.";

"UbiquitousStoreUnlockableError.errorDescription" = "Não foi possível sincronizar com o iCloud";
"UbiquitousStoreUnlockableError.failureReason" = "Não foi possível desbloquear os dados do iCloud, sua senha pode ter sido alterada.";
"UbiquitousStoreUnlockableError.recoverySuggestion" = "Se alterou sua senha noutro dispositivo, atualize novamente neste dispositivo para continuar a usar o iCloud Sync.";

"UbiquitousStoreUnprotectedError.errorDescription" = "O armazenamento do iCloud não está protegido por senha";
"UbiquitousStoreUnprotectedError.failureReason" = "Cancelando a sincronização do iCloud porque o armazenamento não está protegido por nenhuma senha";

"PairingFailedError.errorDescription" = "Falha no pareamento";
"PairingFailedError.failureReason" = "Não foi possível concluir o pareamento com o par.";

"PairingDeniedError.errorDescription" = "Pareamento negado";
"PairingDeniedError.failureReason" = "O par negou a solicitação de pareamento.";

"SyncingFailedError.errorDescription" = "Falha na sincronização";
"SyncingFailedError.failureReason" = "Não foi possível concluir a operação de sincronização.";

"PersistentStoreLockedError.errorDescription" = "O armazenamento está em uso";
"PersistentStoreLockedError.failureReason" = "Tente repetir a operação em alguns instantes.";

"UnsuportedDocumenTypeError.errorDescription" = "Tipo de documento sem suporte";
"UnsuportedDocumenTypeError.failureReason" = "Não há suporte para o documento solicitado.";

"WrongDocumentPassphraseError.errorDescription" = "Senha incorreta";
"WrongDocumentPassphraseError.failureReason" = "Não foi possível abrir o documento com a senha fornecida.";

/*
 * The %@ will be replaced by another application name. Example:
 * 
 * Failed to communicate with Safari.
*/
"ScriptingBridgeError.errorDescription" = "Falha na comunicação com %@";
"ScriptingBridgeError.failureReason" = "Falha ao solicitar que %@ realize a operação desejada.";

"CouldNotSaveDocumentError.errorDescription" = "Não foi possível salvar o documento";
"CouldNotSaveDocumentError.failureReason" = "Ocorreu um erro ao tentar salvar seu documento.";

"SecureEnclaveNotAvailableError.errorDescription" = "Autenticação do dispositivo indisponível";
"SecureEnclaveNotAvailableError.failureReason" = "O seu dispositivo deve possuir uma senha ou Touch ID habilitados para usar este recurso";

"IACError.UnsupportedCallback" = "'%@' não é uma ação x-callback-url suportada por %@";
"IACError.UnsupportedScheme" = "O aplicativo com o esquema '%@' não está instalado neste dispositivo";

"SyncMissingPremium.errorDescription" = "Sincronização desativada";
"SyncMissingPremium.failureReason" = "Atualize para o Premium para continuar sincronizando mais de %d itens";

"ImportMissingPremium.errorDescription" = "Importação atingiu o limite de itens da versão Grátis";
"ImportMissingPremium.failureReason" = "A versão Grátis está limitada a %d itens. Por favor atualize e tente importar este arquivo novamente.";

